results/1/server1/apiary-1.0.0/DEEP.log
Benchmarking DEEP
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.86ms   13.76ms   1.13s    97.23%
    Req/Sec    15.86k     2.74k   33.60k    68.65%
  923813 requests in 30.00s, 107.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 429
Requests/sec:  30792.55
Transfer/sec:      3.58MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.54ms   10.45ms 910.10ms   97.70%
    Req/Sec    15.86k     2.23k   25.76k    67.84%
  934807 requests in 30.00s, 108.76MB read
  Socket errors: connect 0, read 0, write 0, timeout 113
Requests/sec:  31160.22
Transfer/sec:      3.63MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.11ms   12.05ms   1.23s    98.94%
    Req/Sec    15.99k     2.16k   26.38k    67.87%
  940675 requests in 30.00s, 109.45MB read
  Socket errors: connect 0, read 0, write 0, timeout 209
Requests/sec:  31355.84
Transfer/sec:      3.65MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.71ms   11.27ms 980.76ms   97.58%
    Req/Sec    16.44k     2.29k   25.65k    64.71%
  966936 requests in 30.00s, 112.50MB read
  Socket errors: connect 0, read 0, write 0, timeout 138
Requests/sec:  32231.26
Transfer/sec:      3.75MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.23ms  204.64ms   2.35s    99.07%
    Req/Sec    17.24k     4.46k   45.78k    73.11%
  973170 requests in 30.00s, 113.23MB read
  Socket errors: connect 0, read 33, write 0, timeout 132
Requests/sec:  32438.06
Transfer/sec:      3.77MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.39ms   21.75ms   1.88s    99.74%
    Req/Sec    16.87k     2.63k   27.69k    71.99%
  985910 requests in 30.00s, 114.71MB read
  Socket errors: connect 0, read 0, write 0, timeout 38
Requests/sec:  32863.47
Transfer/sec:      3.82MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.62ms   11.16ms 941.97ms   96.75%
    Req/Sec    16.47k     2.67k   29.40k    67.98%
  960234 requests in 30.00s, 111.72MB read
  Socket errors: connect 0, read 0, write 0, timeout 634
Requests/sec:  32007.26
Transfer/sec:      3.72MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.85ms   18.28ms   1.41s    99.69%
    Req/Sec    16.76k     2.78k   33.64k    70.78%
  978628 requests in 30.00s, 113.86MB read
  Socket errors: connect 0, read 0, write 0, timeout 360
Requests/sec:  32620.77
Transfer/sec:      3.80MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.12ms   15.70ms   1.28s    99.57%
    Req/Sec    16.72k     2.60k   30.04k    70.43%
  977560 requests in 30.00s, 113.74MB read
  Socket errors: connect 0, read 0, write 0, timeout 213
Requests/sec:  32583.67
Transfer/sec:      3.79MB
-----------------------------------------------
Running 30s test @ http://localhost:8080/deep/foo/bar/baz/100
  2 threads and 800 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.93ms   34.20ms   1.58s    99.91%
    Req/Sec    16.66k     3.00k   32.50k    71.89%
  964572 requests in 30.00s, 112.23MB read
  Socket errors: connect 0, read 0, write 0, timeout 162
Requests/sec:  32152.38
Transfer/sec:      3.74MB
=================== summary ===================
machine:      server1
ghc version:  7.8.3
bench target: apiary-1.0.0
bench:        DEEP
bench mode:   30s * 10
average:      32020.55
stdev:        692.35
=================== oneline ===================
server1,7.8.3,apiary-1.0.0,DEEP,30s,10,32020.55,692.35